# Learning Pandas: DataFrame Operation

In [2]:
import pandas as pd

df = pd.read_csv('example.csv')
df

    Name  Age      City
0   Adil   23  Matannur
1   Aman   19   Vellore
2   Ziya   15       Tly
3  Zahra    9       Knr

In [3]:
df.head(2)

   Name  Age      City
0  Adil   23  Matannur
1  Aman   19   Vellore

In [4]:
df.tail(2)

    Name  Age City
2   Ziya   15  Tly
3  Zahra    9  Knr

In [5]:
df[['Name', 'City']]

    Name      City
0   Adil  Matannur
1   Aman   Vellore
2   Ziya       Tly
3  Zahra       Knr

In [6]:
df[['Name', 'City']].values

array([['Adil', 'Matannur'],
       ['Aman', 'Vellore'],
       ['Ziya', 'Tly'],
       ['Zahra', 'Knr']], dtype=object)

In [7]:
agegt20 = df[df['Age']>=20]
agegt20

   Name  Age      City
0  Adil   23  Matannur

In [8]:
agelt20 = df[df['Age']<20]
agelt20

    Name  Age     City
1   Aman   19  Vellore
2   Ziya   15      Tly
3  Zahra    9      Knr

In [9]:
df_ziya = df[df['Name']=='Ziya']
df_ziya

   Name  Age City
2  Ziya   15  Tly

In [10]:
df_mult_cond = df[(df['City']=='Matannur') | (df['Age']<=15 )]
df_mult_cond

    Name  Age      City
0   Adil   23  Matannur
2   Ziya   15       Tly
3  Zahra    9       Knr

In [11]:
selected_cities = ['Tly', 'Knr']
df_tlyorknr = df[df['City'].isin(selected_cities)]

df_tlyorknr

    Name  Age City
2   Ziya   15  Tly
3  Zahra    9  Knr

In [12]:
df[df['Name'].str.startswith('Z')]

    Name  Age City
2   Ziya   15  Tly
3  Zahra    9  Knr

In [13]:
df.iloc[0:2]

   Name  Age      City
0  Adil   23  Matannur
1  Aman   19   Vellore

In [15]:
df.loc[df['Age']>20, ['Name', 'City']]

   Name      City
0  Adil  Matannur